const { SlashCommandBuilder, EmbedBuilder } = require('discord.js');

module.exports = {
    data: new SlashCommandBuilder()
        .setName('help')
        .setDescription('Показва ти наличните команди на бота и какво правят.'),
    async execute(interaction) {
        const embed = new EmbedBuilder()
            .setColor('Blue')
            .setTitle('🤖︱Помощ за ботя')
            .addFields(
                { name: '🎮︱Забавни', value: '`/meme` - меменца от редит.\n`/spoof` - Пиши от името на друг потребител.\n`/ascii`- Променя съобщение в ascii стил .\n`/coin`- Хвърли монета (ези или тура).\n`/emojify`- Променя съобщение в еможи стил.\n`/howgay`- Провери колко гей си ти или някой твой приятел.\n`/howmuch`- Провери някой колко те обича.\n`/kill`- Убии някого по забавен начин.\n`/pp`- Колко ти е голям?\n`/predict`- Прави се на врачка, Ще ти отговори с (Да или Не).\n`/rps`- Камък, Ножица или Хартия?\n`/wouldyourather`- Кое би предпочел?' },
                { name: '🛠️︱Помощни', value: '`/larger` - Уголемява еможи.\n`/vote` - Прави вот секция.' },
                { name: '⚙️︱Административни', value: '`/purge` - Чисти съобщения.\n`/say` - Говориш от името на бота.\n`/snipe` - Връща последното изтрито съобщение.\n`/dm` - Праща лично съобщение на потребител.' },
                { name: '📖︱Информационни', value: '`/info` - Информация за сървъра.\n`/whois` - Информация за потребител.\n`/ping` - Проверява пинга на ботя.' },
            )
            .setFooter({
                text: 'BB-9.',
                iconURL: interaction.client.user.displayAvatarURL(),
            })
            .setTimestamp();

        await interaction.reply({ embeds: [embed] });
    },
};
